[{"TSNE1":5.781782627105713,"TSNE2":11.209221839904785,"content":"I really thank God for the friends, coworkers and family who supported me through it all. After the divorce I got remarried, but my ex just kept trying to get custody and then failing to show up because of his drug addiction. And still, I was told it was my job to build trust and figure out how to heal the family."},{"TSNE1":15.05203628540039,"TSNE2":20.82740592956543,"content":"He died from an overdose two years ago. With everything I’ve just shared, his death still tears me apart inside. There was always a part of me that hoped he would find recovery and come back to the kids. I took an incessant amount of videos and photos of the boys to share with him so that he could see what he missed when the man I loved finally came back. But that never happened"},{"TSNE1":4.812355041503906,"TSNE2":3.0088255405426025,"content":". But that never happened. There are still times I feel guilty about choosing the children and choosing myself. I worry that I made the wrong decision – that if I had stayed with him, I could have made him better."},{"TSNE1":-31.45647430419922,"TSNE2":15.284708976745605,"content":"The speed with which it all came together was shocking, but Natalie never looked back. She was thrilled for this opportunity to start fresh, to build a safe and secure new life for herself and her children."},{"TSNE1":-25.652790069580078,"TSNE2":13.182278633117676,"content":". We've seen the need for our safety services really grow where we turn away thousands and thousands of people who need safe shelter each year. Our police force responds to over a hundred thousand domestic violence incidents per year and our shelter can only accommodate a small number of the people who need it"},{"TSNE1":-22.739023208618164,"TSNE2":10.889583587646484,"content":". In Philadelphia we have less beds than other cities our size for domestic violence victims who are fleeing violence. Without Women Against Abuse I shudder to think where I would be. I can't even begin to imagine what my life would be, where I would be. I wouldn't be sitting here the person I am today. But I've never asked myself that question. Thank God I never had to."},{"TSNE1":-27.021921157836914,"TSNE2":18.65741539001465,"content":". She took a job as a home health aid and is working to complete the necessary exams and courses to become a Certified Nursing Assistant."},{"TSNE1":-26.874208450317383,"TSNE2":18.586545944213867,"content":"Sara received a $1,000 scholarship from the Allstate Foundation to subsidize the cost of continuing her education, and embarked on her studies at the Professional Nurses Service Training Center, Inc."},{"TSNE1":-24.943111419677734,"TSNE2":15.867362976074219,"content":"Sara is currently renting a single family home with the option to purchase. Women Against Abuse staff members helped Sara outfit her new home with furniture, and continue to offer support and encouragement as Sara makes the challenging transition to independence."},{"TSNE1":-24.98445701599121,"TSNE2":15.937723159790039,"content":"Sara’s life has changed dramatically through Women Against Abuse’s supportive services; she and her children now wake each day in a safe home, excited by their bright future."},{"TSNE1":-11.39924430847168,"TSNE2":-0.5925359725952148,"content":"When I was about 14 or 15, my mom met “her person” and has been married to him for 30 years because she finally took the time to love herself. That is my message – you must love yourself.\n\nIt took me 20 years to fully forgive my mother for all she exposed my brothers and me to. But what won’t kill you will certainly make you stronger, and I am a force to be reckoned with!"},{"TSNE1":-9.137757301330566,"TSNE2":5.873640537261963,"content":"Today I have four beautiful children. My oldest daughter is engaged to a wonderful young man. I broke the cycle for my kids. They know we have a zero-tolerance policy for abuse. I never wanted to be married or live with a man after all I had experienced, but that is finally starting to change. I’m not afraid anymore. I want those things now."},{"TSNE1":-19.666358947753906,"TSNE2":-1.3929847478866577,"content":"I also have a flourishing career, and I'm leading the charge for change in my role within City Council."},{"TSNE1":-22.612749099731445,"TSNE2":10.736772537231445,"content":"Looking back, I’m so grateful for Women Against Abuse, because had I not had that organization in my life as a child, I can promise you that I would have been a different woman today. Those words and seeds that were planted in me by the women and men who worked there stayed within me and blossomed and grew."},{"TSNE1":-31.46420669555664,"TSNE2":15.280179977416992,"content":"The speed with which everything was resolved was shocking, but Natalie never looked back. She was thrilled with this opportunity to start over, to build a new, secure life for herself and her children."},{"TSNE1":-14.027789115905762,"TSNE2":6.88207483291626,"content":"I am a survivor of domestic violence & I share that with you to help others avoid a similar fate. For anyone out there who is suffering in silence, let me be that voice for you. Listen to me when I tell you, It is not your fault. There are resources available to help you break free and build a life of peace.\n\nThere is hope."},{"TSNE1":-16.419965744018555,"TSNE2":7.730583667755127,"content":"There is hope.\n\nMy story touches on so many systems – from hospitals, to work places, to law enforcement and courts, to behavioral health, to addiction treatment providers.\n\nIt was also heavily influenced by neighbors – people living next door to the abuse. If a coordinated community response like Shared Safety had been in place for me, I wouldn’t have fallen through the cracks."},{"TSNE1":-16.064254760742188,"TSNE2":6.056844711303711,"content":"Maybe if my childhood had been different – if I hadn’t been abused as a child and sexually assaulted as a teen; if I’d had a trusted person to confide in; or a safe place to go; Maybe if a teacher or a doctor or a neighbor or a supervisor had noticed something wasn’t quite right and said something or done something."},{"TSNE1":-14.074002265930176,"TSNE2":6.874863624572754,"content":"I am a survivor of domestic violence & I share that with you to help others avoid a similar fate. For anyone out there who is suffering in silence, let me be that voice for you. Listen to me when I tell you, It is not your fault. There are resources available to help you break free and build a life of peace.\n\nThere is hope."},{"TSNE1":-16.68694305419922,"TSNE2":7.977528095245361,"content":"There is hope.\n\nI urge all of you listening today to help us bring Shared Safety to its full potential.\n\nTell the people in your life about this.\n\nBe part of the change by joining a Shared Safety subcommittee.\n\nSupport the work financially.\n\nAnd, rally with us to protect the well-being, the safety and the freedomof our neighbors.\n\nTogether, we can build a better way."},{"TSNE1":-23.99799919128418,"TSNE2":5.6535468101501465,"content":"I want to make sure that people who are in the difficult situation I was in have somewhere to turn when it seems everyone else has deserted them; somewhere they can go to be protected and receive all the resources they need to heal."},{"TSNE1":-4.72789192199707,"TSNE2":-3.1817193031311035,"content":"I was never abused by my mother again, and left for a small college in the fall. Nine months after I reluctantly left him, my brother moved into my father’s house.\n\nBy my 40’s, I’d become a strong woman and mother of three children– all of whom were flourishing both socially and academically."},{"TSNE1":-16.463239669799805,"TSNE2":-11.00565242767334,"content":"The kids spent time in therapy, and I talked with them frequently about how you can’t always prevent everything bad from happening to you; you can only control how you handle it."},{"TSNE1":-5.689319610595703,"TSNE2":-3.081481456756592,"content":"A decade later, I look back on this as a survivor with a successful career and a respectful, loving second marriage. But what I believe I’ve contributed most to the world are my children. I realized this while reading a passage from my child’s college entry essay:"},{"TSNE1":-6.344301700592041,"TSNE2":-4.121613502502441,"content":"“…My mother never took back my father and I do not blame her. I would not be the person I am today if my father had not left. I watched my mother work harder than ever to support our family. Even through times of despair, I learned you can get through anything if you push yourself and keep your head held high"},{"TSNE1":-6.691509246826172,"TSNE2":-4.4384284019470215,"content":". My fathers’ actions showed me the person I never want to be and helped me form the morals that I live my life by today.”"},{"TSNE1":-5.329801082611084,"TSNE2":-6.193376541137695,"content":"I can see my 14 year old self smiling, and she says “They know that’s not OK; That is not who they will ever be; They will love their children; There will not be violence allowed in their homes.”\n\n... I think that young girl would be proud of me."},{"TSNE1":-6.566834926605225,"TSNE2":1.2941473722457886,"content":"The violence and abuse didn’t stop right away, even though I had left the relationship. Despite having an intervention order, he continued to stalk and harass me. It took a long time for me to feel safe again.\n\n \n\nWhat the experience taught me"},{"TSNE1":-8.897785186767578,"TSNE2":-0.11132616549730301,"content":"What the experience taught me\n\nIt is never too late to leave. I always thought that everything was my fault, and nobody would believe me. I realise now that none of this was my fault, and nobody has a right to determine where my life goes."},{"TSNE1":-22.878124237060547,"TSNE2":4.806185245513916,"content":"When you’re in the midst of abuse, you feel empty and alone. You don’t feel human. It can be hard to see, but there are places you can go for help. You are worth more than nothing, you’re worth everything."},{"TSNE1":-6.601362228393555,"TSNE2":4.335620403289795,"content":"Jade’s boyfriend controlled her and physically abused her until she found the strength to leave with support from friends and colleagues.\n\n“\n\nI congratulated myself for surviving the terrible experience I had endured. I saw it as a great feat of strength."},{"TSNE1":-8.846712112426758,"TSNE2":2.2792139053344727,"content":"Regaining my sense of self\nStaying with a supportive friend and going into counselling helped me gain my strength back. I began to realise that I am a wonderful person. And, instead of hating myself, I congratulated myself for surviving the terrible experience I had endured. I saw it as a great feat of strength."},{"TSNE1":-7.088465690612793,"TSNE2":0.751994788646698,"content":"What the experience taught me\nI realised that, no matter how much I loved him or felt sorry for him, his behaviour would never change. Every chance that I gave him became another opportunity for him to hurt me. Opening up and talking to someone I trusted and getting support from a counsellor were the best things that I did. I’m now with an awesome guy and I’ve never felt so good about myself."},{"TSNE1":-5.314613342285156,"TSNE2":2.232333183288574,"content":"Despite once being in love, Sallie made a choice to end an abusive relationship and started doing things to take care of herself and reclaim the person she was before.\n\n“\n\nBeing in an abusive relationship made me realise that, just because you fall in love with someone, it doesn’t mean that they are right for you."},{"TSNE1":-5.224993705749512,"TSNE2":2.201467990875244,"content":"Being in an abusive relationship made me realise that, just because you fall in love with someone, it doesn’t mean that they are right for you. Once someone behaves in an abusive way more than a few times, it’s not just a mistake brought on by their own stresses, it’s what’s called character"},{"TSNE1":-7.185929775238037,"TSNE2":2.2312588691711426,"content":". Making the decision to leave an abusive person is incredibly hard but taking a positive step to free yourself is worth it. I learnt that I needed time to heal the hurt and feel like my old self again but it did happen. I also realised just how important it is to go out with friends rather than being alone."},{"TSNE1":-3.1245527267456055,"TSNE2":1.6445939540863037,"content":"Donna came to Australia at 21 and developed an intimate relationship with someone she thought she knew. The longer she stayed with him, the harder it was to leave. On leaving the relationship, Donna slowly regained her confidence, undertook study at university and gained secure work.\n\n“"},{"TSNE1":-7.312758922576904,"TSNE2":-1.1241413354873657,"content":"“\n\nI learnt a lot of lessons the hardest possible way. If I had a friend who was going through a similar situation, this is what I would tell her."},{"TSNE1":-4.361351013183594,"TSNE2":0.39367058873176575,"content":"Regaining my sense of self\n\nOnce I left the relationship, I slowly found myself again. I realised how capable I am. I went back to university and then got a stable job."},{"TSNE1":-9.813390731811523,"TSNE2":-1.2780117988586426,"content":"I recently met someone new. It took a long time. I didn’t trust that someone could be kind and loving to me and my children. I also wasn’t sure that I trusted my own judgement. But my new partner is great. He treats me with respect and as an equal, and I feel safe. \n\n \n\nWhat the experience taught me"},{"TSNE1":-7.230542182922363,"TSNE2":-0.5974823832511902,"content":"What the experience taught me \n\nI learnt a lot of lessons the hardest possible way. If I had a friend who was going through a similar situation, this is what I would tell her.\n\nTalk to someone you trust and feel safe with.  \n\nTry to have some time apart from your partner. Think back to before you met him, and see how your life has changed since then. Has it changed for the better?"},{"TSNE1":-8.536515235900879,"TSNE2":1.8665255308151245,"content":"Regaining my sense of self\n\nIn spite of everything, my deep-seated belief that his abuse was wrong and not my fault somehow got me through. Good friends helped me and are still helping me to feel stronger and get back on my feet again. I’ve just started counselling and know that, in time, I’ll keep moving forward and feel even stronger.\n\n \n\nWhat the experience taught me"},{"TSNE1":-8.687657356262207,"TSNE2":0.4481526017189026,"content":"What the experience taught me \n\nIt taught me to believe in myself and to know that I deserved better. It was hard but I got out. If I knew someone in a similar situation I’d tell them that “no matter what they tell you, never ever believe that the abuse is your fault!”"},{"TSNE1":-8.511454582214355,"TSNE2":-2.1147773265838623,"content":"“\n\nRelationships should never be that hard. The right person or people will come into your life and you’ll wonder why you ever stayed so long with an abuser."},{"TSNE1":-4.980813503265381,"TSNE2":-1.0698246955871582,"content":"I hit rock bottom emotionally and fell into a deep depression. I mourned for a long time and began to drink and go out to avoid being alone.\n\n \n\nRegaining my sense of self"},{"TSNE1":-14.459983825683594,"TSNE2":-1.2630136013031006,"content":"I put together the pieces of my life with the support of a close friend. She saw the depths of pain I was in and literally swooped in to save me. She held on tight to me and let me cry and learn and feel. She listened to me and gave me the encouragement I needed to move on"},{"TSNE1":-13.376999855041504,"TSNE2":-0.1822310835123062,"content":". She helped me see the truth about my relationship rather than accepting what I’d come to believe about myself because of the emotional abuse I’d experienced."},{"TSNE1":-5.3559956550598145,"TSNE2":-0.5171892046928406,"content":"I soon began therapy, quit drinking, moved back to the city, got a fabulous job and went back to study. I began to rediscover myself in a whole new light.\n\nEven though I have peace within myself, sometimes I still feel hurt that I fell in love with someone who was unable to love me the way I believed she would.\n\n \n\nWhat the experience taught me"},{"TSNE1":-7.533992767333984,"TSNE2":0.4197951555252075,"content":"What the experience taught me \n\nRelationships should never be that hard. The right person or people will come into your life and you’ll wonder why you ever stayed so long with an abuser. I found it really helpful seeing a counsellor and having the support of a good friend. Looking back, I wished I had found a way to live separately. Having your own financial independence is so important."},{"TSNE1":-8.528191566467285,"TSNE2":-5.975877285003662,"content":"Maybe I’ll always be scared of him but he no longer has control over me, bit by bit I’m feeling like me again and feel positive about the future.\nWarning – Laura talks about her experiences of verbal, physical and sexual abuse, which some readers might find upsetting or triggering."},{"TSNE1":-18.968721389770508,"TSNE2":4.6453166007995605,"content":"Since then I’ve been more involved with RISE and have got a lot of strength and confidence from meeting women in the same situation. It’s shocking to hear how many relationships followed exactly the same pattern."},{"TSNE1":1.504059076309204,"TSNE2":-12.243012428283691,"content":"Shame and self-blame\nI used to feel so ashamed about being in an abusive relationship, I couldn’t believe it had happened to me and felt so stupid. What I realise now through working with RISE is that perpetrators are so skilled at breaking you down and making you think you’re crazy, worthless and that it’s your fault. I know I did nothing to deserve what he did to me and I’m a good person."},{"TSNE1":-20.54756736755371,"TSNE2":4.353434085845947,"content":"I had therapy through RISE that focussed on trauma and it really did change my life, I wouldn’t have been able to afford it privately but the RISE sessions were subsidised. I’m really grateful to everyone at RISE for their support, they’ve made me feel really welcome."},{"TSNE1":-20.051023483276367,"TSNE2":4.209362030029297,"content":"Since being involved with RISE and Survivors Network, I feel able to be open with people about my experiences as I think the culture of shame and secrecy needs to stop. RISE is so vital to be able to support, advise and hold people in crisis and when they’re rebuilding their lives"},{"TSNE1":-19.79567527770996,"TSNE2":3.7842562198638916,"content":". I’ve attended different events with RISE and I’ve met other survivors who have amazed me with their unconditional support."},{"TSNE1":-8.908186912536621,"TSNE2":-7.193818092346191,"content":"I’m slowly getting better but I know it’s going to take time, I have good weeks and bad weeks and suffer from severe anxiety and depression. I’ve lost friends and family members since all this, people who got angry at me because I couldn’t leave, not understanding what life was like for me and how it wasn’t that simple at all"},{"TSNE1":-8.716692924499512,"TSNE2":-6.267349720001221,"content":". Now I have a small circle of amazing friends who I can be honest with about how I’m feeling. Maybe I’ll always be scared of him but he no longer has control over me, bit by bit I’m feeling like me again and feel positive about the future."},{"TSNE1":-12.545199394226074,"TSNE2":6.3448052406311035,"content":"As a survivor of domestic abuse, each day brings a sense of peace and healing. To those of you reading who have been victims of domestic abuse, to those who are victims now, and especially to those who will become a victim of domestic abuse, I promise you there is hope. You chose to read this today for a reason. Before I get into my story, I want you to pause for a moment"},{"TSNE1":-12.394591331481934,"TSNE2":7.045132160186768,"content":"I share my story with you to further clarify what it is like to be a victim of domestic violence, to understand myself as a survivor of domestic violence and reflect on the impact of this journey both personally and professionally. I also want to provide support and comfort to those who have or will suffer from domestic violence.\n\nThis is my story"},{"TSNE1":-23.90366554260254,"TSNE2":-2.517522096633911,"content":"I was introduced to Krav Maga which is a self-defense and fighting system developed for Israeli Defense Forces. A combination of my fight training, and going to the gym, I actually started to feel a little better about myself, but I still was not eating properly"},{"TSNE1":-23.586484909057617,"TSNE2":-2.362989902496338,"content":". I was eventually introduced to a personal trainer who taught me proper techniques of working out, but more importantly she showed me the proper way to eat, finally convincing me that with proper nutrition, combined with training, I could eat and lose weight a health way. I finally developed the body I was looking for and a new passion in life for physical fitness training."},{"TSNE1":9.439448356628418,"TSNE2":-1.9870532751083374,"content":"One of the best predictions of future violence is a history of past violent behavior. When my relationship ended with him, I was contacted by one of his ex-girlfriends who told me that she wished she only reached out sooner. She told me when she was with him she experienced some of the same violent behavior that I went through"},{"TSNE1":9.412957191467285,"TSNE2":-1.5135442018508911,"content":". And as time went on, the girlfriends after me would reach out to me asking if I had experienced any of his violent behavior. Yet we all concluded that I seemed to get the worst of it."},{"TSNE1":-23.07221794128418,"TSNE2":-2.046480178833008,"content":". Since then, I have gone to a counselor which helped me overcome some, not all of the emotional distress. I have joined a new gym and I train harder than ever which has always been one of my true passions. Counseling is a great tool however I found the best therapy to be the gym, talking with my family and friends and most of all, sharing my story."},{"TSNE1":-10.342741966247559,"TSNE2":15.305760383605957,"content":"In May of 2019, I successfully graduated with my Master’s Degree from and in September 2019, I began pursuing my doctorate degree.\n\nA Bright Future Ahead"},{"TSNE1":0.35453447699546814,"TSNE2":-12.425349235534668,"content":"I often found myself reflecting on the words of one researcher: It takes a long time to forgive yourself, especially if you are a person who tends to be hard on yourself. You probably can’t believe that you, of all people, got involved with a toxic man. Maybe you saw the signs, yet you remained in the relationship in order to fix him or change him"},{"TSNE1":-11.937602996826172,"TSNE2":3.3688011169433594,"content":". Once I began to believe in myself, I began to understand that my story was impactful and I could make a difference. I decided to no longer hide from my experiences as a victim of domestic abuse; instead, I embraced my encounters and became a more resilient survivor and took control of my entire existence"},{"TSNE1":-11.901143074035645,"TSNE2":3.628053665161133,"content":". I realized that I could never again allow myself to become a victim of domestic violence if I truly wanted to obtain authenticity. I was now not a victim, but a survivor."},{"TSNE1":-12.924236297607422,"TSNE2":5.6698808670043945,"content":"As my journey continues, I hope to leave you with this message. Domestic violence does not discriminate. There is no one story fits all and each story is unique. There is a light at the end of the dark tunnel and you do not have to live in darkness forever. Please continue to follow my journey as I take my tragedy and turn it into a triumph"},{"TSNE1":30.374719619750977,"TSNE2":10.100595474243164,"content":". Keep an eye out for my upcoming book releasing this year, A Trooper in Moore Ways than You Know where I share my entire story."},{"TSNE1":-19.432039260864258,"TSNE2":12.609048843383789,"content":"I was able to use both my individual counseling and group support sessions to help me work through this all. I will never forget all that was poured into me behind the Domestic Abuse Project of Delaware County. I’m a survivor of 2021. DAP has given me my sanity back, belief in myself, and peace of mind"},{"TSNE1":-15.086359977722168,"TSNE2":9.48033618927002,"content":". I have learned so much through the services provided: mountain meditation scriptures, understanding healthy relationships, trust, accountability, safety, honesty, support cooperation, and RESPECT."},{"TSNE1":-18.236614227294922,"TSNE2":13.943582534790039,"content":"Once I finished my individual and group sessions it was bittersweet to know  all the beautiful women I met through my time with DAP. We exchanged phone numbers to help support each other.  Shortly after the group session, I was enrolled with JJ Peterson mental health facility"},{"TSNE1":-18.291452407836914,"TSNE2":11.6362943649292,"content":". While there, I continued to learn many tools to help me overcome domestic abuse and I am proud to say I am a survivor! I am involved with my church Ministry and as a volunteer with DAP. I am also looking to reopen my business, build a better relationship with friends and family, and continue the journey of self-care"},{"TSNE1":-19.558671951293945,"TSNE2":15.19326400756836,"content":". Sometimes all it takes is a knock at the door and the time to listen to hear someone else’s story. My passion now is to help those in need by sharing my story, just like DAP helped me."},{"TSNE1":-20.04338264465332,"TSNE2":14.181722640991211,"content":"Through free resources provided by DAP, including, case management, SELF support group, individual counseling, family advocacy and relocation assistance, I found the courage to dig deep enough to take the necessary steps to change my and my daughter’s life for the better."},{"TSNE1":-20.879276275634766,"TSNE2":14.400776863098145,"content":"Having a safe place to stay, along with the support the staff at DAP provided me with important resources that empowered me to achieve my goals of maintaining our safety and gaining my independence. At the end of this journey, I’m proud to say that I have the keys to my own home. I’m finally free."},{"TSNE1":-15.881360054016113,"TSNE2":1.5151792764663696,"content":"What an amazing journey life has brought me. Everything that was set to kill me has actually brought me to this beautiful place called “Freedom”. Freedom from my past. Never would I have thought in a million years that I would have an opportunity to share my journey with the hopes of helping someone else find their freedom as well."},{"TSNE1":-10.016142845153809,"TSNE2":1.403862476348877,"content":". One of the other things that I learned during this time as well is that stability is not the cure to the trauma that a person experience through abuse. I fought for my freedom because I wanted it so bad. You really have to want it bad enough. I went to counselling even when I didn’t feel like going. Counselling is a huge part of your healing process"},{"TSNE1":-11.700080871582031,"TSNE2":1.7624526023864746,"content":". Trauma is huge and needs to be treated as such! I also quoted a lot of affirmations daily until I believe the power behind the words that I was speaking. Every single day I told myself that I was strong, I was worthy, I was powerful and beautiful. Today 5 years later I believe Every word and it shows!"},{"TSNE1":-20.477190017700195,"TSNE2":16.36287498474121,"content":"I’ve always wanted to give back just as a way of saying thank you with the hopes of having the opportunity to one day help someone the same way that Dap stepped in and helped me. Almost a year ago I decided to reach out to Joy Cason (Director of Dap’s safe house) Through email inquiring about having any part time positions"},{"TSNE1":-18.0819091796875,"TSNE2":9.967789649963379,"content":". I really wasn’t expecting Joy to respond at all but to my surprise not only did Joy respond right away, She let me know that she was looking for a weekend Advocate. March 2021 will make one year and here I am the person on the other side giving victims just what was given to me 5 years ago. I am what you call a Survivor!"},{"TSNE1":12.447397232055664,"TSNE2":21.37267303466797,"content":"In May of 2016, just before he was scheduled for first chance at parole, he caught a virus in prison that attacked his heart and lungs, and a week later, he passed away."},{"TSNE1":-10.537654876708984,"TSNE2":4.939915657043457,"content":"One day, when my firstborn was small, I was home caring for him and Dr. Phil came on and used a term I’ve never forgotten- “defining moments.” I continue to this day to use his term “Defining Moments” about events in my life my abuser’s death was one of those moments"},{"TSNE1":-14.846145629882812,"TSNE2":1.298931360244751,"content":". The weight of the world had been lifted from my shoulders and, meanwhile, I was destroying my body, my health and my boys lives, with the drinking and fear. I realized I was free and it was time to change."},{"TSNE1":-16.640708923339844,"TSNE2":2.964669942855835,"content":"I quit drinking on June 7, 2016 and completed five years of continued sobriety in a few days."},{"TSNE1":-17.075603485107422,"TSNE2":11.664606094360352,"content":"Today I have a certificate in Victim Advocacy from Neumann University and am a Domestic Abuse Project of Delaware County volunteer. I have spoken at DAP’s medical conference, a Physician’s lecture series and DAP yearly bingo event. I have become a certified spinning instructor, and completed several distance running races, including one full marathon, and will be competing in my first Ironman 70"},{"TSNE1":-16.259998321533203,"TSNE2":11.802592277526855,"content":".3 triathlon this July in Geneva, NY."},{"TSNE1":-16.00663948059082,"TSNE2":3.623157024383545,"content":"I was released from prison in March 2017 and finally got clean on April 22, 2017. I slowly began to turn my life around. I worked on myself and my recovery. I got my place, worked towards a promotion at work, and started my first career. I became a strong, independent woman in recovery that other women looked up to. I even took Riley from my ex"},{"TSNE1":-31.101741790771484,"TSNE2":-0.15344683825969696,"content":". I even took Riley from my ex. Riley looked like he had been starved, his ribs were showing, and he had no energy or life in his eyes. I was finally able to give him a safe home."},{"TSNE1":-14.035134315490723,"TSNE2":3.5710461139678955,"content":"I feel safe now. I’ve finally been able to focus on building my life and chasing my dreams. I am truly happier than I have ever been in my life. I pray never again. I am happy. I am free. I am Heather and I am a survivor."},{"TSNE1":4.606209754943848,"TSNE2":16.8802433013916,"content":"I was terrified that something would happen to her. We shared custody for four frustrating and fear-filled years, until my ex’s true side finally revealed itself to the judge."},{"TSNE1":-13.205580711364746,"TSNE2":2.531484842300415,"content":"While at the Safe Haven, I learned the prerequisite for beginning again was forgiveness. I had to completely strip myself of any and all negativity. His way of still controlling me lied in the bitterness, resentment, and blame that I harbored inside. I finally let it go.\n\nI was NOT a victim. I had SURVIVED."},{"TSNE1":-11.872511863708496,"TSNE2":0.3115527927875519,"content":"I took responsibility for my life and my daughter's in that moment. It wasn't our fault that we were in this position, but it was my duty to carry on. By taking my power back, I completely changed the trajectory of our lives. I discovered self-love. I learned to accept my WHOLE self, imperfections and all. I no longer felt ashamed and unworthy"},{"TSNE1":-9.602165222167969,"TSNE2":6.66881799697876,"content":". I was bound and determined to be the mother that my daughter deserved, and finally break the cycle of Domestic Abuse. Everything he said I couldn’t do, I went on to achieve – and more!"},{"TSNE1":-18.231395721435547,"TSNE2":-0.8065814971923828,"content":"I didn’t know it at the time, but I was being shaped and molded into a powerful force. I went from being homeless, broken, insecure, and defeated; to a driven and confident advocate, coach, speaker, and influencer. My voice has been heard on every platform, from Seventeen Magazine, to The University of Pennsylvania, all the way to the State Capitol"},{"TSNE1":-19.875520706176758,"TSNE2":-2.8886728286743164,"content":". I even went on to win my first World Title along the way!"},{"TSNE1":-13.69302749633789,"TSNE2":-4.573336124420166,"content":"Today, I’m grateful to be in a healthy relationship with a wonderful partner. Looking back, I can see now that our hardships are designed to make us stronger. Each of us has the ability to bounce back, but we have to be willing to work for it. To say NO, and take a stand, even at the highest stakes"},{"TSNE1":-15.415125846862793,"TSNE2":-7.482227802276611,"content":". The moment we let our circumstances define us, will almost certainly be the thing that keeps us suffering. So, let your experiences be used to fuel a mission of awareness, empathy, and – most importantly – to spread love."},{"TSNE1":-15.72154712677002,"TSNE2":-7.31467342376709,"content":"In closing, I have a quote that means a lot to me, and I would like to gift it to all of you:\n\nOnce in a while, take the time to encourage yourself. Remind yourself that life is a process of weathering and rebuilding. Be kind to yourself as you heal and learn. There is purpose in your journey. There is light in your heart. There is a future waiting for you. Remember that, and trust."}, {"TSNE1":4.9611496925354,"TSNE2":23.122827529907227,"content":". The court also incorrectly stated that domestic violence restraining orders do not extend to survivors of non-physical abuse."},{"TSNE1":1.2263422012329102,"TSNE2":25.464380264282227,"content":". Finally, Beverly got the safety, justice, and peace of mind she deserved."},{"TSNE1":3.1374151706695557,"TSNE2":24.512332916259766,"content":"This case was significant not just for Beverly, but for abuse survivors throughout California. Far too many California courts base their restraining order decisions on how much time has passed since physical abuse occurred — in some cases, the limit is just 2 weeks"},{"TSNE1":3.703042507171631,"TSNE2":22.84885597229004,"content":". But the Court of Appeal’s decision in this case has set a new, binding legal precedent that can be cited by attorneys and abuse survivors throughout the state."},{"TSNE1":6.86279296875,"TSNE2":25.08184242248535,"content":"'You don't know what a victory this is for me. I feel so empowered and safe.' Jennifer came to FVAP fearing for her safety and the safety of her family."},{"TSNE1":5.6786208152771,"TSNE2":23.505067825317383,"content":". The Court of Appeal decided to uphold Jennifer’s restraining order, sending another strong message that non-physical abuse is serious and must be stopped."},{"TSNE1":4.0767621994018555,"TSNE2":23.0839786529541,"content":"This case is extremely important because many trial courts, to this day, only recognize domestic abuse as physical violence. This is a case that trial courts throughout California can now use to affirm that abuse comes in many forms, and survivors deserve protection from all forms of abuse.​"},{"TSNE1":-18.810522079467773,"TSNE2":25.182647705078125,"content":"Blanche Cook is a student, a mother, and a survivor of domestic and intimate partner violence."},{"TSNE1":-21.58909034729004,"TSNE2":25.452484130859375,"content":". Her mother was very supportive and felt like Blanche was safe, protected, and in good hands when she was in the hospital."},{"TSNE1":-6.767312526702881,"TSNE2":12.497055053710938,"content":"“It all happened so fast. By the time I woke up in the hospital, I felt overwhelmed. I was in complete shell shock. Everyone around me had already found out and I didn't even know how yet. It was the most difficult situation I had been through in my whole life. I was just so relieved to have my mother’s support. I was so lost and had no idea how to restart my life all over"},{"TSNE1":-7.410125255584717,"TSNE2":11.510631561279297,"content":". However, she did not know that this horrific incident landed her and her ex-husband on the front page of the newspaper and national news outlets. “It was very shocking at first. I never thought that would happen to me. As hard as everything was to accept, it ended up helping me so much in the healing journey. I didn’t have to explain my story to anyone really"},{"TSNE1":-19.803335189819336,"TSNE2":24.233972549438477,"content":"For those experiencing abuse and weighing the decision of whether or not to come forward, Blanche shares her thoughts for survivors.\n\n“I would tell them that they can overcome this and the healing process is not an easy process but it’s definitely worth it to have your life back after abuse.”"},{"TSNE1":-13.39693546295166,"TSNE2":-11.507040023803711,"content":". It’s very scary and a lot more people go through it than people want to believe.”"},{"TSNE1":-20.064044952392578,"TSNE2":24.161754608154297,"content":"Blanche shares with us what has been most helpful in her healing journey."},{"TSNE1":-10.694429397583008,"TSNE2":2.7336642742156982,"content":"“My determination was most helpful. I did not want to be just another statistic. I wanted to heal and become stronger. That’s exactly what I did for years following the abuse. I felt like I became the person I was before the abuse. I missed that person. It took time, but finding myself again was one of the happiest feelings.”"},{"TSNE1":34.44511413574219,"TSNE2":0.6183230876922607,"content":"“I was floating on a high of being out of the relationship.” It wasn’t until six months later that she began to experience Post-Traumatic Stress Disorder (PTSD). Dedeker hit a low point in her experience with the effects of PTSD, and strugged with depression and thoughts of suicide.\n\n“It was a first for me to hit that emotional low. I knew I needed to do something and get some help.”"},{"TSNE1":36.23548889160156,"TSNE2":-0.8007810711860657,"content":"After having mixed experiences while looking for a therapist who was both trauma-informed and understanding of non-monogamy, Dedeker found a practitioner of somatic experiencing therapy, which she found beneficial to her healing.\n\n“Finally being able to address what was going on in my body helped to free my voice to be able to talk about what happened.”"},{"TSNE1":35.19200897216797,"TSNE2":-1.6095483303070068,"content":"Dedeker’s advice to other survivors of intimate partner violence is to trust your gut.\n\n“I wish I could have told myself, and had my younger self truly believe it, that it’s worth it to speak up when you’re first feeling like something is off. If you can tell someone you trust, who will hold you in a compassionate way, it’s worth it.”\n\nDedeker advises partners of survivors to have open arms."},{"TSNE1":-19.289052963256836,"TSNE2":-9.881840705871582,"content":"“Hold them physically or emotionally, on a good day, a bad day, a confusing day; meet them where they’re at.”\n\nShe also encourages “compassionate curiosity.”\n\n“Be willing to listen, to ask what is helpful to your partner, to find out what you could do differently next time a trigger comes up.”"},{"TSNE1":35.66423797607422,"TSNE2":-1.078553557395935,"content":"She says it’s okay to not know what to do at first—“We aren’t given a script for this”—but that it’s important to seek an outside education and learn more.\n\nDedeker also finds healing in her own work. As a relationship coach and somatic experiencing practitioner in training, Dedeker has channeled her own experience into better supporting clients in abusive relationships."},{"TSNE1":-16.844852447509766,"TSNE2":-0.3539315462112427,"content":"“I found for the first time that sharing my own experience was something that could help my clients.”\n\nHer work on her book and podcast also shifted after surviving abuse."},{"TSNE1":34.901466369628906,"TSNE2":-0.7481081485748291,"content":"“How can I talk about being any kind of authority on relationship advice while I’m in an abusive relationship? How can I own up to having been in an abusive relationship while trying to be an expert on healthy communication?’”\n\nBeing open about her experience, however, allows Dedeker to be even more accessible and beneficial to others."},{"TSNE1":-16.13761329650879,"TSNE2":-1.1743626594543457,"content":"“My work before was about empowering people, especially women, that they could choose the kind of relationship they wanted to have. Empowering people to choose good relationships and leave behind bad ones.”"},{"TSNE1":-8.948250770568848,"TSNE2":-3.273153781890869,"content":"“What I want on a T-shirt or maybe my gravestone is the phrase ‘no jerk is worth it.’ You are worth so much more. Every single person is worth so much more than putting up with abusive behavior.”"},{"TSNE1":-10.302328109741211,"TSNE2":23.299671173095703,"content":"Therapy became central for Elise’s healing, especially through developing healthy coping mechanisms.\n\n“I would give my therapist a million dollars if I could. She saved me. She was the person I wanted to tell everything to. I know I wasn’t her best friend, but she was mine. Therapy should be so much more normalized, especially for high schoolers.”"},{"TSNE1":-11.826299667358398,"TSNE2":21.373884201049805,"content":"In Elise’s first relationship after experiencing the abuse, she waited until she was comfortable to let her partner know that she might have flashbacks and he reacted in a supportive way.\n\n“I didn’t feel ready to tell him everything, but I felt like it would help me if he knew that this was something I was dealing with.”"},{"TSNE1":-12.38242244720459,"TSNE2":22.177244186401367,"content":"Elise also told her mother, though accidentally. When Elise was waking up from anesthesia after a surgery, her mother asked if she was in pain.\n\n“I said that nothing hurts as much as what he used to do to me.”\n\nWhen she was awake and back from the hospital, her mom let her know that Elise didn’t have to tell her anything, but that she was there for her and that it was not her fault."},{"TSNE1":-12.435585975646973,"TSNE2":23.195432662963867,"content":"“I’m so grateful for the amount of support everyone has given me. Each person I told made me feel better about sharing my story.”\n\nTo help ensure others don’t have to go through what she experience, Elise believes that school, communities, and families should remove the taboo from talking about sexual violence."},{"TSNE1":-4.717817783355713,"TSNE2":6.163760185241699,"content":"“People avoid it because it’s such a hard subject to talk about. But if I had known about warning signs of abuse, maybe it would have been easier for me to tell someone when it happened to me.”"},{"TSNE1":30.083274841308594,"TSNE2":17.15862464904785,"content":"In addition to therapy, having visual art as an outlet has been central in Elise’s healing. She has what she calls an alter-book. It’s an old book that whenever she starts contemplating self-harm, she destroys or alters the book in the most artistic way she can."},{"TSNE1":30.413799285888672,"TSNE2":15.705083847045898,"content":"“Whatever I’m feeling goes into my book. I’m not an artist by any means. I just put my feelings on the page. It helps me to see my progress when I look through the book, but it’s not linear, it’s a rollercoaster of emotions.”"},{"TSNE1":-13.422082901000977,"TSNE2":24.117515563964844,"content":"If Elise could tell survivors one thing, she would remind them that surviving sexual violence shows much more about who you are—the strength and resilience in your character—than about what happened to you.\n\n“You are not a victim, you are a victory. Remember— you’ve made it through 100% of your bad days. You made it this far, you can keep going.”"},{"TSNE1":-18.58527183532715,"TSNE2":1.9984118938446045,"content":"“So many people question their experience. But every survivor has something important to say. Your voice matters. You are loved, you deserve to be here. The fault and blame is only with the person who committed this crime.”"},{"TSNE1":2.413698673248291,"TSNE2":32.655094146728516,"content":"“With the abuse I had endured, it felt like I was finally getting my voice back after being silenced for two years.”  After leaving the abusive relationship, Stevie experienced flashbacks, nightmares, and feelings of depression and anxiety. “What affected me most were the nightmares. After leaving my ex, I felt like I wasn’t safe anywhere. I couldn't relax"},{"TSNE1":-13.978307723999023,"TSNE2":-13.55438232421875,"content":". I couldn't relax. It felt like there was a threat waiting around every corner.”"},{"TSNE1":-3.9077281951904297,"TSNE2":11.174372673034668,"content":"Though her family was supportive throughout the safety planning process and helping her leave the abusive relationship, she says that they have sometimes made her feel ashamed for having stayed in the relationship for so long and have not been fully supportive of some aspects of her healing process."},{"TSNE1":0.7039704322814941,"TSNE2":33.00851821899414,"content":"Stevie says that seeing a therapist has been extremely important in her healing process. Her therapist has helped her identify healthy coping strategies and grounding techniques, such as breathing exercises and checking in with her senses. “Learning grounding techniques has been super important for me. Setting healthy boundaries and realizing what I’m worth has been crucial, too.”"},{"TSNE1":1.5880383253097534,"TSNE2":33.06947326660156,"content":"When Stevie met with a group of five other survivors, it was the first time she’d shared her story with anyone outside of her close friends and family. “They were the first people who truly were able to understand what I’d gone through and listened to me without judgement. I cried in the shower after because of the incredible release of negative energy I felt.”"},{"TSNE1":3.40217661857605,"TSNE2":33.33903884887695,"content":"It took Stevie a while to consider herself a survivor of intimate partner violence. “I had heard about domestic violence from PSAs that left an image in my head that to be a domestic violence survivor you had to have obvious signs of physical abuse, like a black eye. So I never considered that what I endured could be an abusive relationship"},{"TSNE1":23.560623168945312,"TSNE2":-8.858580589294434,"content":". It’s really important to educate people about of all the forms of domestic violence so that we don’t have this one image of what it looks like. Just because I don’t fit the stereotype of what a domestic violence survivor looks like doesn’t mean I’m not one.”"},{"TSNE1":-23.256620407104492,"TSNE2":1.3596184253692627,"content":"Six months after leaving the relationship, Stevie started a blog where she and other survivors could share their stories. She started by inviting friends of hers who were survivors to write about their experiences, then others began contacting her, hoping also to share their stories. The blog grew into a podcast and eventually, into a nonprofit. The organization, WeAreHer"},{"TSNE1":-22.845609664916992,"TSNE2":1.2440048456192017,"content":". The organization, WeAreHer.net, focuses on story-sharing, community building, and education efforts."},{"TSNE1":0.10271841287612915,"TSNE2":34.24703598022461,"content":"Stevie is passionate about prevention education, especially for young people. She emphasizes how vital it is to teach kids and teens about healthy friendships, setting boundaries, appropriate touch, and other topics that help them grow into adults who engage in healthy, intimate relationships."},{"TSNE1":-19.52646255493164,"TSNE2":2.6324822902679443,"content":"“Connecting with other survivors has been incredibly valuable. It made me feel that I wasn’t alone, that I wasn’t the only person who had been through this, and that I wasn’t crazy.”"},{"TSNE1":-27.069791793823242,"TSNE2":-11.960245132446289,"content":"Though she is glad she disclosed the abuse, Tarhata says speaking about it brought up many difficult emotions. “There were a lot of after-effects. The rapes kept coming into my mind like a broken record. I could not function. It felt like the PTSD, shaking, anxiety, paranoia, anorexia, and suicidal thoughts had completely taken over my life.”"},{"TSNE1":-10.816837310791016,"TSNE2":-6.407780647277832,"content":".” After getting through that difficult period, she found herself surrounded by the people who had stood by her and supported her. “After years, I eventually found people who were healthy and safe. I found out who my real friends and family were, and I let the others go.”"},{"TSNE1":-26.366275787353516,"TSNE2":-11.361616134643555,"content":"Tarhata was worried that she had acted inappropriately, so she was surprised the next day to find messages on her phone of love, support, and gratitude for telling her story. Because of hearing Tarhata’s story, several of the students had gone to the school counselor to discuss their own experiences of sexual violence for the first time"},{"TSNE1":-18.422182083129883,"TSNE2":-2.61203932762146,"content":". “That’s when I found my voice—and I’ve been sharing my story ever since.”"},{"TSNE1":-23.87406349182129,"TSNE2":-11.278326988220215,"content":"Tarhata has blended her career as a nurse with her mission of sharing her story and advocating for other survivors by becoming a sexual assault forensic nurse examiner. She finds immense fulfillment and purpose in doing everything she can to create a trauma-informed, patient-focused experience for those under her care. “When I’m called into a case, I am totally about the patient"},{"TSNE1":-23.811052322387695,"TSNE2":-11.537519454956055,"content":". I look at them through a lens of amazement at how strong they are and how much wisdom they have,” Tarhata says. “At the end of every interaction I let them know how much I admire them to sit there with me and go through an entire exam after having been through such a traumatic experience. My patients are some of the strongest people I know. They are definitely not alone"},{"TSNE1":-16.965442657470703,"TSNE2":-9.71589469909668,"content":". They are definitely not alone. I do my best to tell them this and honor their strength.”"},{"TSNE1":-24.754892349243164,"TSNE2":-12.143132209777832,"content":"To best support survivors, Tarhata says, we should just listen. “Listen and let survivors speak their truth. It seems simple, but it takes a lot of patience, introspection, and selflessness.” She emphasizes that it is important not to ask survivors details of their experience, rather to let them tell their story in whatever way they choose and at whatever time they choose"},{"TSNE1":-18.262361526489258,"TSNE2":-10.015868186950684,"content":". “Offer yourself to be part of their healing process but do it on their timeline.”"},{"TSNE1":-25.349193572998047,"TSNE2":-12.293745994567871,"content":"Tarhata knows from her own experience that patient and non-judgemental listening can be truly healing. Her sister has been her biggest advocate, listener, and supporter throughout her healing process. After learning of the sexual assault, Tarhata’s sister did not pressure her to go to the police, but instead she listened and waited for Tarhata to feel ready to report it"},{"TSNE1":-18.994802474975586,"TSNE2":-4.674138069152832,"content":". “She didn’t make me do anything I didn’t want to do. She waited until I was ready. She gave me the power of choice. Everyone was trying to make me do what they thought would help me. People were trying to force me to act in a certain way, but my sister didn’t. Because of that, she truly gave me my voice back"},{"TSNE1":-26.4932861328125,"TSNE2":-14.04521369934082,"content":".” In addition to going with her to all of her medical appointments and counseling sessions, her sister would also help her continue eating even when Tarhata felt like she couldn’t. “I was too paranoid to do the simplest things like going to the grocery store. My sister would often come by and give me food, knowing that I had absolutely nothing in the fridge.”"},{"TSNE1":-25.26565170288086,"TSNE2":-14.410135269165039,"content":"Tarhata remembers one incident in particular in which her sister’s support saved her life when she was experiencing a period of depression and suicidal thoughts. “I was driving over the Bay Bridge in San Francisco, and I wanted to drive myself off the overpass. I turned the wheel and was about to do it"},{"TSNE1":-25.518110275268555,"TSNE2":-13.962361335754395,"content":". But then I thought about my sister and how she listened to me, and I decided not to go through with it,” says Tarhata. “She may not have been there, but she saved my life.”"},{"TSNE1":-27.12167739868164,"TSNE2":-14.222953796386719,"content":"Another important aspect of Tarhata’s healing has been finding the strength to spend time outside again. “I had been indoors for so long and hadn’t been eating, so I was really pale and my cheeks were sunken in. I felt so ashamed, and I was paranoid about people seeing me"},{"TSNE1":-28.325496673583984,"TSNE2":-1.7526532411575317,"content":".” She started by going on walks around the park, and when she got her rescue dog, Bonkers, he motivated her to continue spending time outdoors. “My dog was everything to me. When I was scared to go outside, he would walk with me. When I didn’t eat, he would eat with me. Everything that made me feel uneasy, he would be the one to keep me calm"},{"TSNE1":-28.291126251220703,"TSNE2":-1.7644506692886353,"content":". Bonkers came to all of my speaking events—everyone knew him. It’s funny how a little rescue dog can rescue you.”"},{"TSNE1":-24.226770401000977,"TSNE2":-7.968704700469971,"content":"A few years later when Tarhata’s friends started having children and she and her husband had their son, she realized there was a lack of engaging and appropriate children books about healthy touch and relationships"},{"TSNE1":-22.701642990112305,"TSNE2":-7.01442289352417,"content":". She also found that the books that did exist did not feature any characters of color, something that had been a barrier for her seeing herself in characters in children's books when she was growing up and did not want her son to struggle with."},{"TSNE1":-24.656267166137695,"TSNE2":-6.652871131896973,"content":"She decided to talk to parents and teachers about where students were learning about healthy touch and relationships. Students said they wished they learned more about this. There was a gap between teachers who thought that parents would talk to their children at home, and parents who thought teachers would educate students on the topics at school"},{"TSNE1":-24.267223358154297,"TSNE2":-8.469301223754883,"content":". Tarhata decided to do something about this—she conducted research and wrote her master’s thesis on a nurse-led program for elementary school students on healthy bodies and relationships. She then wrote an illustrated children’s book that will soon also be available in Spanish and Tagalog."},{"TSNE1":-25.97229766845703,"TSNE2":-6.931101322174072,"content":"She recommends to parents that they reframe consent in child-friendly language and start talking about it early. “Consent is needed in every social setting. For kids, consent can be about sharing crayons with a classmate. I also like to use the concept of ‘red light, green light’ to talk about consent"},{"TSNE1":-25.055648803710938,"TSNE2":-7.363510608673096,"content":".” She says that some people resist talking to kids about these topics because they do not discuss sex yet, but Tarhata says it’s about learning respect, boundaries, and appropriate touch—which can be discussed at any age and applied to many topics."},{"TSNE1":-21.196203231811523,"TSNE2":-5.769130706787109,"content":"“What is motivating me right now is that I am a mother. Everything that I am doing is not just for me or other adults, it’s because I want my son to be a good human being. This is my way of passing on leadership to the next generation and giving them the tools they need. The spotlight is now on them, and I’m excited for their future.”"},{"TSNE1":-20.385583877563477,"TSNE2":0.9487488269805908,"content":"“What’s my call to action? It’s for individuals and our society as a whole to be open and talk about this. Discussing sexual assault used to be so taboo. As a society, we are healing together.”"},{"TSNE1":-8.274933815002441,"TSNE2":27.77576446533203,"content":"It's important to me that queer survivors know their stories are valid. Many people don't believe us, because they don't understand same-sex violence. Well, I believe you. And you will find someone else who believes you too."},{"TSNE1":-3.419999122619629,"TSNE2":23.03045654296875,"content":". “It wasn’t until it was over that I really started seeing how much power she had over me. And realizing how terrible it was,” said Isabella."},{"TSNE1":-5.519708633422852,"TSNE2":23.0257511138916,"content":"Today, Isabella is mindful of how the abuse affected her and is re-learning how to engage in romantic relationships—but it hasn’t been easy. “That’s my biggest issue right now. I’ve wanted to date, but since that was my first relationship it’s so hard to trust myself to get into a healthy relationship without repeating [my past] over and over again.”"},{"TSNE1":-6.343493461608887,"TSNE2":24.3267822265625,"content":"Isabella is currently a senior at St. Olaf College where she is studying psychology and “engaging in activism efforts that mix the brain and the body together.” She has started multiple groups on campus, including a chapter of To Write Love On Her Arms, where she facilitates conversations about dating violence, using her own story to encourage others to open up"},{"TSNE1":-20.737808227539062,"TSNE2":0.5393328666687012,"content":". She has also spoken at a sexual assault panel at her school."},{"TSNE1":-8.320761680603027,"TSNE2":27.668140411376953,"content":"“It’s important to me that queer survivors know their stories are valid,” said Isabella. “Many people don’t believe us, because they don’t understand same-sex violence. Well, I believe you. And you will find someone else who believes you too.”"},{"TSNE1":-18.962871551513672,"TSNE2":-12.863170623779297,"content":"“It’s not going to be an overnight thing. It could take months or years.”"},{"TSNE1":14.307554244995117,"TSNE2":27.9114933013916,"content":"Today, Lilly is happily married in a supportive relationship and back in school. “I’m finishing my associate degree in journalism. I’m really excited. I’m almost there!” She shares her story to let other survivors know they are not alone, and to encourage loved ones to speak up if they notice that something isn’t right. “I didn’t know what an abusive relationship was before I was in one"},{"TSNE1":-4.680842399597168,"TSNE2":-11.351007461547852,"content":". And I wish someone had said something.”"},{"TSNE1":-3.8626861572265625,"TSNE2":13.475123405456543,"content":". It could take months or years. The biggest priority is making sure that the person who is being abused understands that this isn’t safe, and that you support them.”"},{"TSNE1":6.065511703491211,"TSNE2":15.160855293273926,"content":". Refused to let me talk to him and refused to let me see him. But thankfully, when we finally got our court date, the judge saw through it and realized that they didn't have a case and that he, in fact, was the abuser. I was very happy to see my son back. I was very happy to see him back. I was very happy to see him back. That doesn't mean it's over"},{"TSNE1":-31.810096740722656,"TSNE2":-7.513467788696289,"content":". That doesn't mean it's over. All of my friends and family that I have, and I'm now making new friends where I'm at, are very happy to see me pick up the pieces and start over. I'm starting to shoot more photography and find new clients in my new area. And I got a new job. My daughter's a competitive gymnast. My son's in the program that I work at"},{"TSNE1":-14.408830642700195,"TSNE2":-17.626853942871094,"content":". We're just very happy to be in a room where we can be together. And I'm very happy to be in a room where we can be together. We're just very happy to be in a room where we can be together. And I'm very happy to be in a room where we can be together. And I'm very happy to be in a room where we can be together"},{"TSNE1":-12.259572982788086,"TSNE2":-2.55200457572937,"content":". And I'm very refreshed version of our lives that we can really call our own and be completely separated from what we were setting up before. My advice for people who are experiencing any level of abuse, just advocate for yourself. Stand up for yourself in the moment, draw a boundary immediately, and follow through in the beginning"},{"TSNE1":-12.199085235595703,"TSNE2":-2.6279566287994385,"content":". Every once they know they can challenge your boundaries, that's where your weakness is. And also, tell your story. There was a long time that I didn't tell my story to my family and my parents. And that ended up biting me because they believed the other person's story. Thank you so much for listening to my story. I hope that it inspires others to leave if they're ready to leave"},{"TSNE1":-11.385842323303223,"TSNE2":-15.635213851928711,"content":". Love yourself above all else and put yourself first and continue to push through and know that you're not alone. And there's always somebody there to support you. And if you need support, please feel free to reach out to me. I'm so grateful to have you reach out. You can find my links below if you need somebody and also if you want to follow my life or my photography from here."},{"TSNE1":-9.6766357421875,"TSNE2":-12.555254936218262,"content":". There was a part of me that found gratitude in my experiences, not necessarily gratitude in him, but gratitude for my experiences because I'm able to use them to help other people now. And it was that spiritual moment."},{"TSNE1":-3.920961618423462,"TSNE2":-16.30224609375,"content":". Let me first and foremost say that me and this person no longer communicate. We do not have any bad blood. She's doing her own thing, and I am definitely doing my own. And, um, I wish her all well. No hard feelings towards this person whatsoever, and, um, I mean, we don't get bitter, we get better. Hello! So, my whole life, I've always felt like a burden"},{"TSNE1":-6.259580612182617,"TSNE2":-15.983758926391602,"content":". Although I have the same heart from when I was a little girl, I have the same energy. I still, I'm just, I have the same personality. I'm always laughing. I'm always helping people more. I'm not trying to like to my own horn here, but it just, I'm explaining who I am. Like, I'm just, I think I'm super nice. I don't know. I don't want to sound like I'm not humble, but I do a lot for others"},{"TSNE1":-6.736461639404297,"TSNE2":-16.993515014648438,"content":". And I'm always laughing. Even if I'm having a bad day, like I'm always laughing. I'm the same person as I've always have been. Like, but I have changed. A lot when it comes, you know, mentally and all that. And now I'm the strongest person that I know. I'm so glad I got out of that relationship because some people, as sad as it is to say, they never get out"},{"TSNE1":-7.807889938354492,"TSNE2":-17.98213768005371,"content":". And I'm only getting stronger. And I'm so proud of myself because the more shit I go through, the more struggles I go through, the more pain I go through, the stronger I am. So that's why. Now I don't settle for less. I don't settle for damn near anybody or anything because I know my worth. I know what I've been through. I know my story. I know what I can bring to the table"},{"TSNE1":-6.459644794464111,"TSNE2":-17.902145385742188,"content":". And if I feel like they can't, then they can't. It is what it is. It's cool. But I have never been so happy and so content with being, being me and being so proud and loving myself. So I encourage you guys to just love yourself enough a little more this time to just leave that relationship and know that it's going to get better"},{"TSNE1":-8.831490516662598,"TSNE2":-18.4216365814209,"content":". I believe in you guys. But as always, as always, not only am I proud of you guys, but you guys are worth it. You guys are beautiful. You guys are handsome. Whatever the fuck you consider yourself, that's what you are. And I'm proud of all of you, regardless whether you did something beautiful today or you just, you woke up and you were a little, you loved yourself a little more today"},{"TSNE1":-10.46076774597168,"TSNE2":-17.87883949279785,"content":". I'm proud of you guys for everything. But as always, Solis Rose, a.k.a. Salsa Rosita. I love you guys. Bye."},{"TSNE1":19.142471313476562,"TSNE2":24.110244750976562,"content":"6. Your partner may not recognise that they’re an abuser\nMy ex has never apologised to me. Everyone has their own truth and I think that in his head he’s a normal guy with normal behaviours and if someone at work asked him if he’d ever been abusive I’m 99% sure his response would be an immediate “No!”\n\nBut in my experience, no-one thinks they’re an abuser."},{"TSNE1":3.300976514816284,"TSNE2":-13.155746459960938,"content":"I imagine it’s incredibly rare for someone to hold their hands up, even years later, and say those words, just like I don’t think anyone would call themselves a rapist. People imagine abusers as beer-drinking 40 year-old men with anger issues and terrible backstories. They picture rapists as greasy monsters in long coats who lurk down the alleyways your mum always told you to avoid"},{"TSNE1":2.4829907417297363,"TSNE2":-10.449265480041504,"content":".” I think one of the most awful things that someone in an abusive relationship can experience is that feeling that you’re no longer the person you were – and now you’ve lost it, you’re too far gone to get that person back, and even if you weren’t, you can’t remember what they were even like to begin with."},{"TSNE1":-0.591851532459259,"TSNE2":-17.896926879882812,"content":"Being in a relationship like this left a deep-rooted self-dislike in me which other people who’ve cared for me have struggled to remove. No matter how much someone tells you you’re swell, the words of someone else who said the complete opposite will always somehow ring truer"},{"TSNE1":27.3923397064209,"TSNE2":-6.009219646453857,"content":". It’s been years since I was with my ex but I still get upset when I see a domestic violence storyline on TV or if someone is being intimidating towards their partner in Tesco or something. The only reason I wanted to watch Little Shop of Horrors was because I knew I’d take solace in the fact that some people’s abusive boyfriends get fed to giant plants"},{"TSNE1":-3.8200080394744873,"TSNE2":-18.22780990600586,"content":". I walk into a room and I have to repeat in my head “You’re as good as everyone else in here” over and over again to keep myself from running back out."},{"TSNE1":-8.158218383789062,"TSNE2":-16.01117515563965,"content":"I am still working really hard on getting to know myself again but I know I can do it. I got away from it, and so can you. I’m angry. Please trust your gut."}, {"TSNE1":21.570444107055664,"TSNE2":10.074201583862305,"content":"The arrest and sentencing\nThe police officers who came around that time weren’t as helpful. I think it’s really important to remember that the way the police respond to domestic abuse is very inconsistent.\n\nIt’s a lottery as to which officers you get, and just because one thinks what you’re reporting isn’t serious or worth looking into it doesn’t mean they’re right."},{"TSNE1":23.358642578125,"TSNE2":5.357680797576904,"content":"He broke his bail conditions and started contacting me. At first it was indirect messages written in his biography section on Twitter. One was written in Russian and when translated read “poison will kill me before justice is served, you will be sorry I’ll make you suffer”"},{"TSNE1":19.745159149169922,"TSNE2":9.268510818481445,"content":"Even if you don’t think you deserve help, getting them convicted could help protect other people one day."},{"TSNE1":25.265090942382812,"TSNE2":-18.814512252807617,"content":"I was really lucky because he pleaded guilty and in March 2014 I went to court to see him sentenced. The police had told me only to expect him to get a fine because it was his first offence but the judge took it more seriously. Shaun’s solicitor said he should be lenient because it was a ‘silly mistake’ and Shaun had already lost his job"},{"TSNE1":25.42953109741211,"TSNE2":-19.300596237182617,"content":". The judge said it was cruel, calculated abuse and gave Shaun an 18-week suspended prison sentence (this means he’s not actually in prison but if he breaks the conditions of his sentence in the next 2 years it will be ‘activated’ and he would go to prison), electronic tagging with a curfew for two months, and ordered him to pay me £250 compensation"},{"TSNE1":19.880155563354492,"TSNE2":6.025800704956055,"content":". He was also given a restraining order that says he can’t contact me via any method or come to the street where I live, anywhere I’m in work or anywhere I’m in education for five years (if he does he’ll go to prison for that)"},{"TSNE1":20.307838439941406,"TSNE2":9.023575782775879,"content":". I am so grateful to the judge for taking it so seriously, I know a lot of people don’t get the same result or even a trial and it really does make a difference to me to know that a judge who sentences criminals everyday thought he deserved that sentence."},{"TSNE1":-3.904542922973633,"TSNE2":5.761541366577148,"content":"I had no idea that someone could abuse you without physically hurting you or that it was something that happened so young. Be clear what you think is acceptable in a relationship and stick to it. If you’re concerned or something doesn’t feel quite right, talk about it with a parent, teacher, counsellor, friend… whoever you trust, and see what they think."},{"TSNE1":-16.679536819458008,"TSNE2":-16.915040969848633,"content":"Looking to the future"},{"TSNE1":17.50299835205078,"TSNE2":7.206373691558838,"content":"I won’t pretend it’s all been easy since he was convicted! Especially to start with I really missed him and felt incredibly guilty that I gave up on him and am the reason he has a criminal record. There are days when I can’t get the things he said to me out of my head and I’m frightened he’ll keep his promises of getting revenge on me one day"},{"TSNE1":27.35637855529785,"TSNE2":-15.041985511779785,"content":". Most of all now though, I’m worried he’s going to do the same or worse to someone else. As I grew up he was still interested in twelve and thirteen year old girls and he posts pictures of semi-naked child celebrities all over his Twitter and Facebook"},{"TSNE1":17.598901748657227,"TSNE2":9.00457763671875,"content":". That’s why I went back to the police and reported the sexual activity he pressured me into when I was under 16, I have to feel I’ve done everything in my power to stop him."},{"TSNE1":-18.97481346130371,"TSNE2":7.282169818878174,"content":"That’s the bad bits though – trust me, it does get easier after you stop having contact with someone whether it’s because you’re brave enough to leave or after they’re convicted. I threw all my energy into raising awareness of domestic abuse with young people and now all sorts of other feminist and political campaigning too"},{"TSNE1":27.5003662109375,"TSNE2":-10.212818145751953,"content":". Learning about gender inequality and violence against women in a wider context helped me see what happened was the result of a sexist society in which many women are oppressed, rather than just entirely my fault."},{"TSNE1":-5.30377197265625,"TSNE2":-20.073772430419922,"content":"Even if you think you couldn’t live without someone, please remember you’re good enough on your own and you don’t need them!"},{"TSNE1":18.1564884185791,"TSNE2":-20.26105308532715,"content":"It might take a little while but once you’re free from someone like that you’ll start noticing how much they held you back. I was so determined not to conform to Shaun’s idea of what girls must look like anymore, I got my hair (which was down to my waist in blonde ringlets) cut short!"},{"TSNE1":25.068805694580078,"TSNE2":-22.92525291442871,"content":"Thinking about the future, I want to finish my A-levels and go to university to study law. Then I want to train as a barrister and work on domestic abuse and women’s rights cases. What I went through with Shaun has opened my eyes to a lot more problems in the world. I don’t think the government does anywhere near enough to protect women from male violence or protect vulnerable people in general"},{"TSNE1":24.37789535522461,"TSNE2":-20.840351104736328,"content":". I was angry at Shaun and determined to stop him hurting anyone else, but now I’m angry at the society which made him that way and systems which let men like him get away with it. I’m definitely going to keep campaigning."},{"TSNE1":-20.525026321411133,"TSNE2":8.359513282775879,"content":"In April 2014, just after Shaun was convicted, I applied for and got funding to start a project to raise awareness of domestic abuse with young people. The Speak Out project launched with an awareness event in July 2014"},{"TSNE1":-20.342288970947266,"TSNE2":7.153896808624268,"content":". Since then we’ve done things like help run teacher training about abuse in teen relationships, trained staff at the mental health unit I was an inpatient at and taught lessons on domestic abuse to sixth-formers. I’ve given talks at several different events and conferences as well as becoming a member of the Women’s Aid Young People’s Advisory Panel"},{"TSNE1":-20.337390899658203,"TSNE2":7.078409194946289,"content":". Being a part of the Women’s Aid group meant I got to go to the House of Commons and speak to a select committee as part of their inquiry into violence against women and girls. It’s really nice to be able to try and raise awareness and make things better for other young people who’ll go through something similar."},{"TSNE1":25.045549392700195,"TSNE2":-22.94377899169922,"content":"In terms of future relationships I think Shaun has put me off for a very long time! I want to focus on my A-levels, getting a degree, becoming a barrister, raising awareness of domestic abuse, campaigning for a more equal and just world first, and to be honest that’s quite enough to be getting on with!"},{"TSNE1":-18.66851234436035,"TSNE2":-17.062442779541016,"content":"Who can help"},{"TSNE1":-14.340938568115234,"TSNE2":15.722497940063477,"content":"There are loads of organisations and people you can talk to about relationships. After the police investigation started I was referred to Victim Support and met with one of their counsellors for a few months. It would have been better if I’d spoken to people much sooner though. You can talk to someone from Brook if they have a service near to you"},{"TSNE1":-13.480364799499512,"TSNE2":14.481752395629883,"content":". There’s also the National Domestic Violence Helpline (0808 2000 247) run by Women’s Aid and Refuge who are specially trained to support people experiencing domestic abuse and they can advise you on how to hide phone calls if someone is checking your phone."},{"TSNE1":-14.396563529968262,"TSNE2":16.15398597717285,"content":"Brook, Women’s Aid and Refuge’s websites all have lots of information about recognizing abuse and asking for help. There is also a really good BBC program called Murdered By My Boyfriend. It’s a real-life story of a girl who was abused and eventually murdered by her boyfriend"},{"TSNE1":21.42995262145996,"TSNE2":-21.47112274169922,"content":". I’ve found watching things like that really help because I recognise so many of Shaun’s behaviors in the way Ashley’s (the girl in the program) boyfriend treats her but when you see it happen to someone else it suddenly seems much more serious."},{"TSNE1":26.572912216186523,"TSNE2":-17.488811492919922,"content":"When it comes to contacting the police I would say talk to another adult or organisation first and ask them to help you speak to the police. The police should take you seriously but they’re not all perfect. I went back after Shaun was convicted to report the sexual activity I never mentioned in the first investigation"},{"TSNE1":25.92698097229004,"TSNE2":-16.73320770263672,"content":". The police officer I spoke to told me he thought I’d ‘misremembered’ and they tried to convince me there was absolutely no point in investigating Shaun even though he still had pictures of really young teenage girls in tiny clothing all over his Twitter"},{"TSNE1":22.26109504699707,"TSNE2":8.54244613647461,"content":". Over a year later and I am still trying to make complaints against those officers! If you take someone with you to talk to the police they can help you explain the situation and make sure the police treat you fairly."},{"TSNE1":-12.867880821228027,"TSNE2":10.641134262084961,"content":"I think the most important thing to remember when you’re thinking of asking anyone for help is that abuse is never your fault and no one apart from you will think it is. In fact, most people will probably be horrified at how much you’ve suffered already. No one deserves to have their life manipulated and taken away from them, domestic abuse is really serious and everyone deserves to be helped."}]